export function স্বরবর্ণগণনা(স্ট্রিং: string): number {
    let সংগ্রাহক: number = 0;
    স্ট্রিং = স্ট্রিং.toLowerCase();
    for (let সূচক = 0; সূচক < স্ট্রিং.length; সূচক++) {
        if (
            স্ট্রিং.charAt(সূচক) === 'a' || 
            স্ট্রিং.charAt(সূচক) === 'e' || 
            স্ট্রিং.charAt(সূচক) === 'i' || 
            স্ট্রিং.charAt(সূচক) === 'o' || 
            স্ট্রিং.charAt(সূচক) === 'u' || 
            স্ট্রিং.charAt(সূচক) === 'á' || 
            স্ট্রিং.charAt(সূচক) === 'é' || 
            স্ট্রিং.charAt(সূচক) === 'í' || 
            স্ট্রিং.charAt(সূচক) === 'ó' || 
            স্ট্রিং.charAt(সূচক) === 'ú' || 
            স্ট্রিং.charAt(সূচক) === 'ü' || 
            স্ট্রিং.charAt(সূচক) === 'ä' || 
            স্ট্রিং.charAt(সূচক) === 'ï' || 
            স্ট্রিং.charAt(সূচক) === 'ö' || 
            স্ট্রিং.charAt(সূচক) === 'ë'
        ) {
            সংগ্রাহক++;
        }
    }
    return সংগ্রাহক;
}
