export class ПробыСкрам { 

    private задачи: string[];

    constructor(задачи: string[]) {
        this.задачи = задачи;
    }

    private планироватьСпринт(): void {
        console.log("\n--- Планирование Спринта ---");
        console.log("Задачи для выполнения:");
        this.задачи.forEach((задача, индекс) => console.log(`- Задача ${индекс + 1}: ${задача}`));
    }

    private провестиЕжедневнуюВстречу(): void {
        console.log("\n--- Ежедневная Встреча ---");
        console.log("Продвижение и блокировки команды.");
    }

    private проверитьСпринт(): void {
        console.log("\n--- Обзор Спринта ---");
        console.log("Представление выполненных задач и увеличенного продукта заказчику.");
    }

    private провестиРетроспективу(): void {
        console.log("\n--- Ретроспектива Спринта ---");
        console.log("Размышления о том, что получилось хорошо, и возможные улучшения.");
    }

    public выполнитьСпринт(): void {
        this.планироватьСпринт();
        this.провестиЕжедневнуюВстречу();
        this.проверитьСпринт();
        this.провестиРетроспективу();
        console.log("\nКонец Спринта.");
    }
}
